channel_api_tests/ctrip/happy_paths/rates_update.xml

URL: http://58.221.127.196:8090/Hotel/OTAReceive/HotelRateAmountNotif.asmx

Request:

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <OTA_HotelRateAmountNotifRQ Version="2.2" PrimaryLangID="language" xmlns="http://www.opentravel.org/OTA/2003/05">
      <POS>
        <Source>
          <RequestorID ID="54394" Type="1" MessagePassword="qaz123">
            <CompanyName Code="C" CodeContext="4085" />
          </RequestorID>
        </Source>
      </POS>
      <RateAmountMessages HotelCode="54394">
        <RateAmountMessage>
          <StatusApplicationControl RatePlanCode="1251431" RatePlanCategory="16" />
          <Rates>
            <Rate Start="2015-10-16" End="2015-10-16">
              <BaseByGuestAmts>
                <BaseByGuestAmt Code="Sell" AmountAfterTax="5000" CurrencyCode="SGD" />
              </BaseByGuestAmts>
              <MealsIncluded Breakfast="false" />
            </Rate>
          </Rates>
        </RateAmountMessage>
      </RateAmountMessages>
    </OTA_HotelRateAmountNotifRQ>
  </soap:Body>
</soap:Envelope>

Response:

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <OTA_HotelRateAmountNotifRS TimeStamp="2015-04-24T12:36:21.5859872+08:00" Version="2.1" PrimaryLangID="en-us" xmlns="http://www.opentravel.org/OTA/2003/05">
      <Success />
      <UniqueID ID="259264369" Type="506" />
    </OTA_HotelRateAmountNotifRS>
  </soap:Body>
</soap:Envelope>